# Q.1 What is Pandas ?
Ans -
 
 
 Pandas is a Python library used for working with data sets. It has functions for analyzing, cleaning, exploring, and manipulating data.

# Q.2 Difference between series and dataframe ?

Series : 
    
    1. Seties is 1 Dimensional.
    2. It Can only contain one data type.
    3. Series is Immutable

DataFrame:
    
    1. Seties is 2 Dimensional.
    2. It Can only contain Multiple data type.
    3. Series is Mmutable

# Q.3 Difference between loc and iloc ?

# df.loc : 

starting to end point include

In [35]:
df = pd.read_csv("C:\\Users\\VINIT SANDESH\\Desktop\\DATA ANALYTICS\\PYTHON\\PROJECT DATASETS\\emp.csv")
df

   Unnamed: 0  emp_id emp_name  emp_Hours  emp_salary
0           0       1  sandesh          9       65000
1           1       2    vinit          9       65000
2           2       3    mansi          9       65000
3           3       4    kunal          8       65000
4           4       5   prjyot          9       65000
5           5       6   pratik          9       65000
6           6       7     raja          9       35000

In [36]:
df.loc[:2 , ['emp_name','emp_salary']]

  emp_name  emp_salary
0  sandesh       65000
1    vinit       65000
2    mansi       65000

# df.iloc : 

starting point include but last point not include .

In [37]:
df.iloc[:4 , [0,1,2,3]]

   Unnamed: 0  emp_id emp_name  emp_Hours
0           0       1  sandesh          9
1           1       2    vinit          9
2           2       3    mansi          9
3           3       4    kunal          8

# Q.4 what does value_counts() ? 
Ans - 


This method is particularly useful for understanding the distribution of values within a column.

# EXAMPLE 1:

In [32]:
df = pd.read_csv("C:\\Users\\VINIT SANDESH\\Desktop\\DATA ANALYTICS\\PYTHON\\PROJECT DATASETS\\emp.csv")
df

   Unnamed: 0  emp_id emp_name  emp_Hours  emp_salary
0           0       1  sandesh          9       65000
1           1       2    vinit          9       65000
2           2       3    mansi          9       65000
3           3       4    kunal          8       65000
4           4       5   prjyot          9       65000
5           5       6   pratik          9       65000
6           6       7     raja          9       35000

In [33]:
df['emp_name'].value_counts()

emp_name
sandesh    1
vinit      1
mansi      1
kunal      1
prjyot     1
pratik     1
raja       1
Name: count, dtype: int64

# EXAMPLE 2:

In [34]:
data = {'Category': ['A', 'B', 'A', 'C', 'A', 'B', 'B', 'C']}
df = pd.DataFrame(data)


df['Category'].value_counts()

Category
A    3
B    3
C    2
Name: count, dtype: int64

# Q.5 how do you handle missing values using pandas ?

In [12]:
# Drop rows with missing values
df.isnull()
df = df.dropna()

In [21]:
df = pd.read_csv("C:\\Users\\VINIT SANDESH\\Desktop\\DATA ANALYTICS\\PYTHON\\PROJECT DATASETS\\emp.csv")
df.head()

   Unnamed: 0  emp_id emp_name  emp_Hours  emp_salary
0           0       1  sandesh          9       65000
1           1       2    vinit          9       65000
2           2       3    mansi          9       65000
3           3       4    kunal          8       65000
4           4       5   prjyot          9       65000

In [28]:
df['emp_salary'][1:3] = None
df

   Unnamed: 0  emp_id emp_name  emp_Hours  emp_salary
0           0       1  sandesh          9     65000.0
1           1       2    vinit          9         NaN
2           2       3    mansi          9         NaN
3           3       4    kunal          8     65000.0
4           4       5   prjyot          9     65000.0
5           5       6   pratik          9     65000.0
6           6       7     raja          9     35000.0

In [29]:
df.isnull().sum()

Unnamed: 0    0
emp_id        0
emp_name      0
emp_Hours     0
emp_salary    2
dtype: int64

In [31]:
df.dropna()

   Unnamed: 0  emp_id emp_name  emp_Hours  emp_salary
0           0       1  sandesh          9     65000.0
3           3       4    kunal          8     65000.0
4           4       5   prjyot          9     65000.0
5           5       6   pratik          9     65000.0
6           6       7     raja          9     35000.0

# Q.6 How do you merge 2 tables using pandas ?

In [17]:
import pandas as pd

 
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Sandesh', 'Mansi', 'Vinit']})
df2 = pd.DataFrame({'ID': [1, 2, 3], 'Age': [26, 18, 24]})

 
merged_df = pd.merge(df1, df2)

print(merged_df)

   ID     Name  Age
0   1  Sandesh   26
1   2    Mansi   18
2   3    Vinit   24

# Q.7 How do you connect jupyter notebook to mysql ?

In [38]:
!pip install mysql.connector

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql.connector in c:\users\vinit sandesh\appdata\roaming\python\python311\site-packages (2.2.9)

In [40]:
import mysql.connector

In [41]:
conn = mysql.connector.connect(host = 'localhost' , 
                             user = 'root',
                             password = '', 
                             database = 'sandesh')

In [42]:
import pandas as pd

In [43]:
pd.read_sql_query("SELECT * FROM  products" , conn)

C:\Users\VINIT SANDESH\AppData\Local\Temp\ipykernel_7740\3947240027.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query("SELECT * FROM  products" , conn)

   ProductId ProductName  Price     Catogory
0          1    ProductA  25.99  Electronics
1          2    ProductB  19.78     Clothing
2          3    ProductC  10.56  Home&Garden
3          4    ProductD  12.90  Electronics
4          5    ProductE  13.65     Clothing
5          6    ProductF  15.87  Home&Garden
6          7    ProductG  76.45  Electronics
7          8    ProductH  34.90     Clothing

# Q.8 What does group by in pandas ?

 groupby function is used to split a DataFrame into groups based on some criteria and then apply a function to each group independently.

In [1]:
import pandas as pd

df = pd.DataFrame ({'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
    'Value': [10, 15, 20, 25, 30, 35]})

data_mean = df.groupby('Category').mean()

data_mean

          Value
Category
A          20.0
B          25.0

# Q.9 difference between CrossTab vs Pivot table ?Â¶

Ans -

Difference between a cross tab and a pivot table is 

Cross Tab                                              
1. Analyze the relationship between two categorical variables.
2. Categorical variables data types used.

Pivot
1. To summarize and analyze data based on different dimensions.
2. Categorical and numerical variables data types used.

# Q.10 In  which scenerio what kind of plot you will use ? Numerical ==? , Categorical ==? 

Ans - 

This is Depends upon what kind dat do we have & insight which helps for Graphical Visualization as well as decision making.

# Numerical plots in data visualization: 
    1. Histogram
    2. Box PLot
    3. Line plot
    4. Scatter Plo

# Numerical plots in data visualization: 
    1. Histogram
    2. Box PLot
    3. Line plot
    4. Scatter Plo

# Q.11 What does TimeDelta in Pandas ?
Ans - 

Timedelta represents the difference between two dates or times.

In [3]:
import pandas as pd

delta = pd.Timedelta(days=5, hours=3, minutes=30)
delta

Timedelta('5 days 03:30:00')

# Q.12 How can you extract day , month , year in a date column using pandas ?

In [4]:
import pandas as pd

data = {'Date': ['2023-08-04', '2023-08-05', '2023-08-06']}

df = pd.DataFrame(data)

df['Date'] = pd.to_datetime(df['Date'])


df['Day'] = df['Date'].dt.day
df['Month'] = df['Date'].dt.month
df['Year'] = df['Date'].dt.year

df

        Date  Day  Month  Year
0 2023-08-04    4      8  2023
1 2023-08-05    5      8  2023
2 2023-08-06    6      8  2023

# Q.13 How can you extract hours , minutes , seconds in a datetime column ?

In [5]:
import pandas as pd

data = {'Datetime': ['2023-12-19 08:30:45', '2023-12-20 15:45:30', '2023-12-18 12:10:20']}

df = pd.DataFrame(data)

df['Datetime'] = pd.to_datetime(df['Datetime'])


df['Hour'] = df['Datetime'].dt.hour
df['Minute'] = df['Datetime'].dt.minute
df['Second'] = df['Datetime'].dt.second


df

             Datetime  Hour  Minute  Second
0 2023-12-19 08:30:45     8      30      45
1 2023-12-20 15:45:30    15      45      30
2 2023-12-18 12:10:20    12      10      20

# Q.14 How do you read a excel file , csv file and json file in jupyter notebook using pandas ?

In [6]:
import pandas as pd

df = pd.read_csv("C:\\Users\\VINIT SANDESH\\Desktop\\DATA ANALYTICS\\PYTHON\\PROJECT DATASETS\\sales_data.csv")
df.head()

,Unnamed: 0,ProductID,QuantitySold,Price,Discount,Category,Supplier,Date,CustomerID,Country,Profit
0,0,C,8,75.539471,0.064576,Toys,Supplier1,01-01-2022,1148,USA,20.835021
1,1,A,8,43.100482,0.142251,Toys,Supplier3,02-01-2022,1079,USA,11.003640
2,2,C,3,66.907525,0.198508,Clothing,Supplier2,03-01-2022,1885,Canada,6.896583
3,3,C,1,67.017674,0.071013,Home,Supplier3,04-01-2022,1212,USA,8.221993
4,4,A,8,58.219722,0.127749,Toys,Supplier3,05-01-2022,1202,UK,8.201146

In [ ]:
import pandas as pd
import json

df = pd.read_json("C:\\Users\\VINIT SANDESH\\Downloads\\dwsample1-json.json")
df

# Q.15 How can you create  excel data from a dataframe using pandas ?

In [22]:
Sample = df.to_excel("C:\\Users\\VINIT SANDESH\\Sample.xlsx")